%{
 *=======================================================================================
 *========================================【M FILE】=====================================
 * Copyright 流体力学与声学技术实验室
 * ALL right reserved.See COPYRIGHT for detailed Information.
 *
 * @File:       SUBOFF_Main0612.m
 * @Brief:      1. 以【SUBOFF】为研究对象，导入[节点]和[节点时域压力]
 *              2. 基于二分法获取[最佳缩放系数]，以[均方根误差]为判断准则
 *              3. 求解场点频域声压
 *
 * @Author:     Haiger
 * @date:       2023.06.12
 *=======================================================================================
%}

clc;
clear;
close all;

%% ------------------------------【1 导入数据 / 输入参数】------------------------------